#include <iostream>
using namespace std;
int main() {
	setlocale(LC_ALL, "rus");
	//8. Даны натуральные числа от 20 до 50.
	//Напечатать те из них, которые делятся на 3, но не делятся на 5.
	/*for (int i = 20; i <= 50; i = i + 1) {
		if (i % 3 == 0 && i % 5 != 0)
		cout << i << " ";
	}*/
	//9. даны натуральные числа от 35 до 87.
	//Найти и напечатать те из них, которые при делении на 7 дают остаток 1, 2 или 5.
	/*for (int i = 35; i <= 87; i = i + 1) {
		if (i % 7 == 1 || i % 7 == 2 || i % 7 == 5)
			cout << i << " ";
	}*/
	//10. Даны натуральные числа от 1 до 50.
	//Найти сумму тех из них, которые делятся на 5 или на 7.
	/*int summa;
	summa = 0;
	for (int i = 1; i <= 50; i = i + 1)
		if (i % 5 == 0 || i % 7 == 0) {
			summa = summa + 1;
			cout << summa << " ";
		}
		*/
	//11. Напечатать те из двузначных чисел которые делятся на 4, но не делятся на 6.
	/*int i;
	for (int i = 10; i <= 99; i = i + 1) {
		if (i % 4 == 0 || i % 6 != 0)
		{
			cout << i << " ";
		}
	}*/
	//12. Найти произведение двузначных нечетных чисел кратных 13.
	/*int prois = 1;
	for (int i = 11; i <= 99; i = i + 2) {
		if (i % 13 == 0) {
			prois = prois * 1;
			cout << prois << " ";
		}
	}*/
	//13. Найти сумму чисел от 100 до 200 кратных 17.
	/*int summa = 0;
	for (int i = 100; i <= 200; i = i + 1) {
		if (i % 17 == 0) {
			summa = summa + 1;
			cout << summa << " ";
		}
	}*/

}